{
  "Surah": "Al-Fatihah",
  "Verse": "1-7",
  "Arabic Text": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
  "Transliteration": "Ṣirāṭa alladhīna an‘amta ‘alayhim ghayri al-maghḍūbi ‘alayhim wa lā al-ḍāllīn",
  "English Translation": "The path of those You have blessed, not of those against whom there is anger, nor of those who are misguided.",
  "Linguistic Analysis": "The verse begins with “sirat al-ladhina an‘amta ‘alayhim” — “the path of those upon whom You have bestowed favour.” This phrase is after we know there is a path, we ask Allah has anyone crossed this path? And this is not a new sentence but a clarification and specification of the “straight path” mentioned in the previous verse. In Arabic rhetoric, this is called “badal” — a substitute that explains what came before. So “Guide us to the straight path” is immediately defined as “the path of those You have blessed.” This removes all ambiguity: the straight path is not a personal opinion or a cultural tradition, but the actual way walked by those whom Allah Himself has favoured. And the reason it is defined by past is there is always volatile behaviour in present, but past never changes. The word “an‘amta” comes from “ni‘mah”, meaning blessing or grace. It is in the past tense, but it carries the sense of continuous and confirmed favour — not a one-time gift, but an ongoing bestowal from Allah. It is also derivative of word \"nu`uma\" which means something soft (hence cattles are called \"anam\" as they chew slowly) and hence this path is soft and easy for those who have been favoured. And “‘alayhim” — “upon them” — is in the accusative case because it is the object of the verb “an‘amta”. These are not random people; they are specifically identified in the Quran itself. In Surah An-Nisa, Allah says: “Whoever obeys Allah and the Messenger — they are with those upon whom Allah has bestowed favour: the prophets, the truthful, the martyrs, and the righteous. And excellent are they as companions.” So the blessed ones are those who combined correct belief with righteous action, under divine guidance. Then comes “ghayri al-maghduubi ‘alayhim” — “not of those against whom there is anger.” The word “ghayr” means “other than” or “not”, and it is used here to exclude a specific group. “Al-maghduub” is the passive participle of “ghadaba” — to be angry. In human terms, anger implies emotion, but in Allah’s case, it is a divine decree of punishment for persistent disobedience and rejection of truth. Al-Qurtubi explained that Allah’s anger is His will to punish those who knowingly oppose His commands after clear evidence has come to them. It is not arbitrary; it is justice. Here Allah does not directly mention who are angry, which implies every creation of Allah is also angry with this group — unlike those who were favoured by Allah himself (by using the word you in phrase those whom You have favoured). Grammatically, “‘alayhim” here is in the nominative case, because it is the subject of a hidden verb — as if to say, “those upon whom anger has fallen.” This differs from the previous “‘alayhim”, which was accusative. The shift shows that the first group is actively blessed by Allah, while the second is passively subjected to consequence. Also al-maghdoobi 'alaihim wa lad-daaalleen is a noun and hence this group is always present as we know noun are permanent, while an'amta 'alaihim is a verb so these favoured ones are relatively temporary or fewer. Then “wa la al-dallin” — “nor of those who are misguided.” The “la” here is not just “not”, but an emphatic negation, reinforcing the exclusion. “Al-dallin” comes from “dalla”, meaning to stray or lose the way. Unlike the angry ones, who knew the truth but rejected it, the misguided sought guidance but went astray due to error, ignorance, or misinterpretation. They are not necessarily malicious, but they are lost — like someone walking in fog, thinking they are on the right road. Now, the structure of the verse is deeply balanced: first, affirmation: the path of the blessed. Then, two exclusions: not the angry, not the misguided. This shows that deviation comes in two forms: willful rebellion — knowing the truth but choosing to oppose it (anger), and sincere error — wanting guidance but following false signs (misguidance). Both lead away from the straight path, though their moral weight differs. There are also variations in recitation. Umar ibn al-Khattab and Ibn al-Zubayr used to recite: “other than those who have earned Your anger and other than the righteous” — but this is understood as a rhetorical emphasis, not a contradiction, because “the righteous” here refers to those who claim righteousness but are not truly on the path. Other reciters varied in the vowel marks of “‘alayhim” — kasra, damma, with or without a “waw” — all accepted as part of the seven ahruf (modes of revelation), showing the Quran’s linguistic flexibility without altering meaning.",
  "Context of Revelation": "This verse was revealed in Mecca, but its interpretation was explicitly given by the Prophet (peace be upon him) in Medina. Multiple authentic narrations — from Adi ibn Hatim, Abdullah ibn Shaqiq, and others — report that when asked, “Who are those who have earned Your anger?” the Prophet said: “The Jews.” And when asked, “Who are the misguided?” he said: “The Christians.” This is not a blanket condemnation of all Jews and Christians, but a reference to specific theological deviations prevalent in their communities at the time of revelation: the Jews, despite having received clear revelation, rejected the Prophet Muhammad, altered parts of their scripture, and killed prophets out of arrogance. The Quran says: “They have earned anger upon anger” (Al-Baqarah: 90). The Christians, though sincere in worship, exaggerated in their religion, claiming divinity for Jesus and the Trinity, thus straying from pure monotheism. The Quran says they are “further astray from the sound way” (Al-Ma’idah: 60). The Prophet’s explanation was accepted by all the early scholars — Ibn Abbas, Mujahid, Sa‘id ibn Jubayr, Qatadah — and Ibn Abi Hatim said he knew of no disagreement among the Companions and their followers on this interpretation. It is not based on ethnicity or modern politics, but on doctrinal stance: those who reject truth after knowing it (anger), and those who worship sincerely but incorrectly (misguidance). This verse also completes the contrast between three paths: the path of the blessed — who follow revelation as it was sent, the path of the angry — who had revelation but corrupted it, the path of the misguided — who sought God but invented their own ways. And the believer asks: “Keep me on the first, and protect me from the other two.”",
  "Reflections": "This verse is the seal of the entire Surah — and of the believer’s daily plea. After praising Allah, acknowledging His lordship, affirming His mercy and judgment, declaring exclusive worship and reliance, and asking for guidance — the servant now defines what that guidance looks like in practice: it is the way of those Allah has blessed. But who are they today? They are those who follow the Quran and Sunnah as understood by the righteous predecessors — the prophets, the Companions, the scholars of truth. Not those who twist religion for power, nor those who water it down for popularity. The straight path is narrow in doctrine, vast in mercy. The exclusion of the two groups is a warning against two dangers that still exist: the danger of knowledge without submission — like those who know Islam is true but reject it out of pride, tribal loyalty, or desire for control. This is the path of anger. The danger of sincerity without knowledge — like those who worship with emotion but ignore revelation, inventing new forms of worship, or following cultural traditions as if they were divine. This is the path of misguidance. The believer must avoid both. He must seek knowledge to avoid error, and submit his ego to avoid rebellion. Also, this verse is the reason Muslims say “Amin” after reciting Al-Fatihah. The Prophet (peace be upon him) said: “When the Imam says ‘not of those who are misguided,’ say Amin — for whoever’s Amin coincides with the Amin of the angels, his past sins will be forgiven.” He used to raise his voice with it, and even the Jews, according to Aisha, envied Muslims for three things: spreading peace, straightening prayer rows, and saying Amin. “Amin” means “O Allah, respond!” or “So be it!” — it is the servant’s seal on his dua, affirming his need and hope. Every time you say this verse in prayer, you are not just reciting words — you are choosing your company for eternity. You are saying: “O Allah, count me among the prophets, the truthful, the martyrs, and the righteous — not among those who knew the truth and turned away, nor among those who searched but got lost.” And Allah, in His mercy, listens.",
  "Similar Verses": ["4-69", "19-58"]
}
