{
  "Surah": "Al-Baqarah",
  "Verse": "2:10",
  "Arabic Text": "فِي قُلُوبِهِم مَّرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ",
  "Transliteration": "Fi qulubihim maradun fa zada-humullah maradan, wa lahum 'adhabun alim bima kanu yakkidhun",
  "English Translation": "In their hearts is sickness, and God has increased their sickness. They will have a painful punishment because of their denial.",
  "Linguistic Analysis": "This verse continues the description of the hypocrites introduced in verses 2:8–9, now diagnosing their inner condition with clinical precision. The word “marad” (sickness) is not used here in its physical sense, but as a metaphor for spiritual and intellectual corruption. Ibn Faris explained that “marad” in Arabic means anything that causes a person to deviate from a state of soundness — whether it is disease, doubt, moral deficiency, or weakness in faith. In this context, it refers specifically to hypocrisy, doubt, and inner conflict — the state of someone who outwardly claims belief but inwardly harbours disbelief, envy, or resentment toward the truth.\n\nThe phrase “fi qulubihim marad” — “in their hearts is sickness” — uses the preposition “fi” (in), indicating that the illness is deeply embedded, not superficial. It is not a passing thought, but a chronic condition of the heart. The heart in Quranic language is not just an organ; it is the seat of belief, intention, and moral perception. When it is sick, the entire person is disoriented — unable to distinguish truth from falsehood, sincerity from pretence.\n\nThen comes the divine response: “fa zada-humullah maradan” — “so God has increased their sickness.” This is one of the most profound and often misunderstood statements in the Quran. It does not mean that Allah arbitrarily inflicted disease on innocent hearts. Rather, it describes a divine law of spiritual cause and effect. When a person chooses hypocrisy — when he lies about his faith, mocks revelation in secret, or clings to disbelief out of pride — Allah, in His justice, allows that sickness to grow. He withdraws the light of guidance, so their doubts multiply, their hypocrisy deepens, and their hearts harden further. This is not punishment in the active sense, but the natural consequence of persistent rejection, confirmed and sealed by divine decree.\n\nThe verb “zada” (He increased) is in the past tense, showing that this increase is certain and already in motion. Every time they hear a verse that challenges their lifestyle and choose to ignore it, every time they perform prayer for show and feel no remorse, every time they spread doubt among believers — their spiritual sickness worsens, and Allah permits it to spread.\n\nThe verse ends with “wa lahum ‘adhabun alim bima kanu yakkidhun” — “and for them is a painful punishment because of what they used to deny.” The word “alim” means agonizing, deeply felt, unbearable — not just physical pain, but the torment of regret, exposure, and eternal loss. The phrase “bima kanu yakkidhun” is often translated as “because of their lying,” but “kadhib” here means more than verbal falsehood. It includes denial of truth, distortion of reality, and persistent rejection of clear signs. Their lie was not a single statement, but a lifestyle of deception — claiming faith while living in opposition to it.\n\nGrammatically, the structure moves from diagnosis (“in their hearts is sickness”) to progression (“Allah increased it”) to consequence (“painful punishment”). It is a complete spiritual pathology: origin, development, and outcome.",
  "Context of Revelation": "This verse was revealed in Medina, during a time when the Muslim community included a group of individuals — primarily from the tribes of Aws and Khazraj — who outwardly accepted Islam but inwardly resented the Prophet’s authority. They were not atheists; many had grown up with monotheistic ideas. But they could not accept that a man from Quraysh, not from their own tribe, would lead them. Their sickness was not ignorance, but envy, tribal pride, and love of leadership.\n\nIbn Abbas said the “marad” here is doubt — not the doubt of a seeker, but the doubt of one who wants not to believe. Qatadah said it is “doubt and suspicion in the matter of Allah.” Others, like Ikrimah and Tawus, said it is riya’ (showing off) — performing acts of worship to be seen, not to draw near to Allah. Abu Al-‘Aliyah and Al-Dahhak confirmed it is hypocrisy, an illness of religion, not the body.\n\nThe increase in sickness occurred as Islam grew stronger — with victories like Badr, the revelation of clear rulings, and the Prophet’s rising influence. Instead of rejoicing, the hypocrites felt threatened. Their envy festered, their doubts multiplied, and their plots became more frequent. Each new blessing for the believers became a new wound for them — and Allah, in His wisdom, allowed their inner corruption to deepen, so their true state would be exposed in this life or the next.\n\nThe Prophet (peace be upon him) was warned about them in revelation, and he treated them with outward kindness while inwardly grieving over their condition. He knew that you cannot force faith into a heart that chooses darkness.",
  "Reflections": "Interestingly this Surah deals very much with heart and the next surah explains Islam so first we become frim in Iman then Allah moves to Islam. This verse informs us about the first symptom of hypocrisy which is passive denial of truth (not accepting that what you are doing is Haram). Spiritual sickness does not always look like open sin. It can look like regular prayer, fasting in Ramadan, and Islamic speech — but with a heart that is cold, envious, or insincere. The danger is that such a person feels no pain he thinks he is fine, while his heart is slowly dying.\n\nThe phrase “Allah increased their sickness” teaches us a terrifying truth: Allah may grant you more of what you choose, even if it destroys you. If you choose doubt over certainty, He may let your doubts grow. If you choose hypocrisy over honesty, He may seal your heart in pretence. This is not cruelty; it is justice. You asked for freedom from truth — and He gave it to you.\n\nBut there is hope in the warning. The fact that the Quran names this sickness means it can be diagnosed and cured. The cure is repentance, self-examination, and sincerity. The moment you admit, “My heart is sick,” you have taken the first step toward healing. The believer does not fear sickness; he fears not knowing he is sick.\n\nAnd the “painful punishment” is not just in the Hereafter. It begins in this life: the hypocrite lives in constant anxiety — fearing exposure, resenting the sincere, and never finding peace. His heart is a prison of contradictions.",
  "Similar Verses": ["9-125", "47-29", "74-31"]
}
