{
  "Surah": "Al-Baqarah",
  "Verse": "2:11",
  "Arabic Text": "وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ",
  "Transliteration": "Wa idha qila lahum la tufsidu fil-ardi qalu innama nahnu muslihun",
  "English Translation": "And when it is said to them, ‘Do not make trouble on earth,’ they say, ‘We are only reformers.’",
  "Linguistic Analysis": "These verses expose a defining trait of the hypocrites: they rebrand corruption as reform. The Arabic word munafiq (or "hypocrite") is derived from nafaqa, which refers to a desert lizard's two-holed burrow. This is a metaphor, as the lizard can escape through one opening if threatened from the other, and in a similar way, a hypocrite pretends to be a believer but secretly conceals disbelief and attempts to deceive others - in this ayat Allah recounts their this methodology of double-standards. It begins with a conditional scenario: “When it is said to them…” — not once, but repeatedly, as part of their pattern. The command “la tufsidu fil-ard” — “do not cause corruption on earth” — uses the verb “afsada”, from “fasad”, which means to spoil, to ruin, to disrupt the natural order. In Quranic usage, “fasad” is the opposite of “salah” (righteousness, order, harmony). It includes moral decay, social injustice, spreading lies, inciting violence, and undermining truth — anything that destroys the balance Allah has placed in creation.\n\nBut their response is chilling in its audacity: “Innama nahnu muslihun” — “We are only reformers.” The word “innama” is a particle of exclusivity and emphasis — they do not say “we are among the reformers”, but “we alone are the true reformers”. They do not deny the accusation; they invert it completely. To them, exposing the Prophet’s message, allying with enemies, sowing doubt among believers, and refusing to support jihad — all of this is “reform”.",
  "Context of Revelation": "These verses were revealed in Medina, addressing the hypocrites among the Ansar, particularly those who resented the Prophet’s leadership and secretly allied with the Quraysh and Jewish tribes. When they were told, “Do not spread discord, do not weaken the Muslims, do not plot with enemies,” they would reply, “We are only trying to bring peace between the believers and the People of the Book,” or “We are protecting the community from extremism.” In reality, their “reform” meant preserving tribal power, avoiding sacrifice, and resisting divine authority.\n\nIbn Abbas explained that their claim of reform was a cover for undermining the Prophet’s mission - to distinguish between Iman and Kufr. Mujahid said that whenever they were confronted about a sin, they would say, “We are only on guidance,” turning rebuke into self-praise. Ibn Mas‘ud defined “fasad” here as disbelief and open disobedience — not just personal sin, but actions that destabilise the entire community.\n\nInterestingly, Salman al-Farisi once recited these verses and said, “The people of this verse have not yet come.” Some understood him to mean that future generations would produce even worse hypocrites — those who wage war against Muslims while calling themselves reformers, like the Khawarij, who believed killing fellow Muslims was “purifying” the faith. Others say Salman meant that the full manifestation of this hypocrisy — where corruption is sincerely mistaken for righteousness — would appear in later seditions. Either way, the warning is timeless.",
  "Reflections": "This is the second sign of a hypocrite, he is fasid or troublemaker yet shows innocence. These verses are terrifyingly relevant today. In every age, there are those who wrap destruction in the language of justice. They call oppression “freedom”, disbelief “enlightenment”, and rebellion against divine law “progress”. They claim to reform society while tearing apart its moral fabric. And the most dangerous among them are not the open enemies, but those who use Islamic terms to justify un-Islamic actions — preaching unity while sowing division, demanding rights while rejecting responsibilities, invoking compassion while denying truth.\n\nBut the deeper warning is personal. How often do we justify our sins as necessary, our laziness as wisdom, our anger as justice? When someone gently reminds us, “This is harming your deen,” do we say, “No, I’m just being practical,” or “I’m protecting my family,” or “I’m standing for what’s right”? The hypocrite’s voice lives in every heart that refuses accountability.\n\nThe phrase “they are not aware” is the most tragic part. It is possible to be so convinced of your own righteousness that you cannot see your own corruption. This is the state of those who pray, fast, and quote Quran — but whose hearts are filled with arrogance, envy, or hatred. They think they are building, but they are burning. They think they are healing, but they are infecting.\n\nThe cure is humility and sincere self-audit. The true reformer (muslih) is not the one who claims the title, but the one who submits to truth, even when it hurts. He accepts correction. He fears his own hidden motives. He knows that real reform begins with the self, not with changing others.",
  "Similar Verses": ["7-56", "26-183", "28-77", "29-63"]
}
