{
  "Surah": "Al-Baqarah",
  "Verse": "2:13",
  "Arabic Text": "وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاسُ قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاءُ ۗ أَلَا إِنَّهُمْ هُمُ السُّفَهَاءُ وَلَٰكِن لَّا يَعْلَمُونَ",
  "Transliteration": "Wa idha qila lahum amanu kama amana al-nas, qalu anu'minu kama amana al-sufaha'? Ala innahum hum al-sufaha', walakin la ya'lamun",
  "English Translation": "And when it is said to them, ‘Believe as the people have believed,’ they say, ‘Shall we believe as the fools have believed?’ In fact, it is they who are the fools, but they do not know.",
  "Linguistic Analysis": "This verse exposes another hallmark of hypocrisy: contempt for true believers. The scenario is simple: someone tells the hypocrites, “Believe as the people have believed.” The word “al-nas” here does not mean “all people”, but the sincere believers — specifically, the Companions of the Prophet (peace be upon him), who accepted Islam with full submission, sacrificed their wealth and lives, and never wavered in faith. The phrase “kama amana al-nas” — “as the people have believed” — implies a standard of belief: complete, humble, and action-backed.\n\nBut their response is dripping with arrogance: “Anu’minu kama amana al-sufaha’?” — “Shall we believe as the fools have believed?” The word “sufaha’” is the plural of “safih”, which means one who lacks sound judgment, whose intellect is clouded by impulsiveness, vanity, or ignorance. In Arabic usage, a “safih” is not just silly; he is morally and intellectually immature, unable to weigh consequences, easily swayed by emotion, and blind to higher realities. To call the Companions “sufaha’” is the height of delusion — these were men who left homes, faced torture, and gave everything for truth.\n\nGrammatically, their question is rhetorical — not a real inquiry, but a mocking dismissal. They frame true faith as foolishness to justify their own disbelief. But Allah immediately flips the script: “Ala innahum hum al-sufaha’” — “Indeed, they themselves are the fools.” The structure mirrors verse 2:12: “Ala innahum hum al-mufsidun” — now “Ala innahum hum al-sufaha’”. The repetition of “hum” (they themselves) is divine emphasis: not only are they fools — they are the very definition of folly.\n\nAnd the verse ends with “walakin la ya‘lamun” — “but they do not know.” Unlike “la yash‘urun” (they do not perceive) in verse 2:12, here it is “la ya‘lamun” — they lack knowledge. This is deeper: perception can be dulled, but knowledge is absent. They are not just unaware; they are ignorant of their own ignorance. True foolishness is not making a mistake — it is believing you are wise while standing on the edge of ruin.\n\nThe “kaf” in “kama” is grammatically in the accusative because it modifies an implied noun — “iman kama amana al-nas” means “belief like the belief of the people”. The comparison is not about quantity, but quality and sincerity.",
  "Context of Revelation": "This verse was revealed in Medina, and the “people” referred to are the sincere believers among the Muhajirun and Ansar — those who embraced Islam without reservation. Ibn Abbas said it means: “Believe as the Companions of Muhammad believed — that he is a true prophet, and the Quran is from Allah.” Ibn Mas‘ud, Ar-Rabi‘, and Ibn Zayd all confirmed that “the fools” is how the hypocrites mockingly referred to Abu Bakr, Umar, Uthman, Ali, and the rest of the Sahabah.\n\nThere is also a narration — though weak in chain — that specifies the “people” as Abu Bakr, Umar, Uthman, and Ali, highlighting that even the greatest of the Ummah were called “fools” by those who valued status over truth.\n\nSome scholars, like Al-Kalbi citing Ibn Abbas, suggested this verse also applies to the Jews of Medina. When they were told, “Believe as Abdullah ibn Salam and his companions have believed,” they replied, “Shall we follow those who abandoned the Torah for a new prophet?” But the dominant view, supported by Ibn Jarir and the flow of the Surah, is that this continues the description of the hypocrites within the Muslim community, who looked down on the sincere believers as naive for accepting Islam so fully.\n\nThe irony is crushing: the hypocrites considered themselves wise, pragmatic, and politically astute — avoiding the “foolish” risk of total commitment. But in reality, they were the ones gambling with eternity for temporary comfort.",
  "Reflections": "This is the fourth and last sign of hypocrite, Allah says he is ignorant of his own loss and thinks he is well-versed. Ahead in this Surah  Allah says, who will leave legacy of Ibrahim except who fools himself (Qur'an 2:130) - this because he himself sacrificed many times for the sake of Allah. How often do people today mock the sincere believer as “extreme”, “backward”, or “out of touch”? The one who prays on time is called rigid; the one who avoids interest is called impractical; the one who upholds modesty is called oppressed. And the mocker thinks he is enlightened — when in truth, he is the fool.\n\nBut the danger is not only in others — it is in ourselves. Do we ever look at a humble, God-fearing person and think, “Why is he so simple? Why doesn’t he play the game like I do?” Do we admire the clever liar more than the honest struggler? Do we value success in the eyes of people more than purity in the eyes of Allah?\n\nThe Companions were called fools because they chose the unseen over the seen, the Hereafter over this world, truth over convenience. But history proved them wise: their legacy built civilizations, while the “wise” hypocrites were forgotten in disgrace.\n\nAnd the final phrase — “but they do not know” — is the tragedy of arrogance. The fool is not dangerous because he is weak, but because he thinks he is strong. He does not seek guidance, because he believes he has none to seek. His greatest blindness is not knowing he is blind.",
  "Similar Verses": ["83-29"; "23-110";]
}