{
  "Surah": "Al-Baqarah",
  "Verse": "2:17",
  "Arabic Text": "مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ ذَهَبَ اللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِي ظُلُمَاتٍ لَّا يُبْصِرُونَ",
  "Transliteration": "Mathaluhum kamathali alladhi istawqada naran falamma ada'at ma hawlahu dhahaba Allahu bi-nurihim wa tarakahum fi dhulumatin la yubsiroon",
  "English Translation": "Their likeness is that of a person who kindled a fire; when it illuminated all around him, Allah took away their light, and left them in darkness, unable to see.",
  "Linguistic Analysis": "These verses present one of the most vivid parables in the Quran — a metaphor so sharp it cuts through pretence. The phrase begins with “mathaluhum” — “their likeness” — and immediately compares to a single man who kindled fire (Prophet) who lights a fire. The use of the singular (“the one who kindled”) is referred to guidance Ambiya and messengers came with.\n\nThe verb “istawqada” means to kindle, to ignite a flame. The form implies effort — he gathered wood, struck a spark, and made light. For a moment, “when it illuminated all around him, so everyone tried to get that light” — “lamma ada’at ma hawlahu” — the fire cast light on everything nearby: the ground, the path, the dangers hidden in the dark. In that moment, any hypocrite could see clearly — what to step on, what to avoid, where to go.\n\nBut then comes the divine intervention: “dhahaba Allahu bi-nurihim” — “God took away their light.” Note the shift from singular (“the one who kindled”) to plural (“their light”). This shows that the parable, what prophets brought they (hypocrites) never got profited from it. Their “light” was never truly theirs — it was borrowed, temporary, granted by Allah’s mercy. And when they proved unworthy, when they used the appearance of faith for deception — He withdrew it, such that Allah didn't took it away from everyone (including the true believers) but just from hypocrites.\n\nWhat remains? “Wa tarakahum fi dhulumatin la yubsiroon” — “and left them in darkness, unable to see.” The word “dhulumat” is plural — layers of darkness, not just one as levels of hypocrisy varies so is the level of darkness. It is the darkness of ignorance, doubt, misguidance, and spiritual blindness. And “la yubsiroon” — they cannot see — not because their eyes are closed, but because the light is gone, and with it, all clarity.",
  "Context of Revelation": "This parable was revealed in Medina about the hypocrites, particularly those who embraced Islam outwardly but never internalised its truth. Ibn Abbas explained that they took pride in Islam — they married Muslims, inherited from them, shared in war spoils — but when they died, Allah stripped them of that honour, just as the fire’s light was taken away.\n\nIbn Mas‘ud gave a deeper interpretation: these were people who were once in the darkness of disbelief, then came to Islam and learned what is halal and haram, good and evil. But then they turned back to hypocrisy, and in doing so, lost even the knowledge they once had. Like a man who sees a snake in the firelight and steps back — but when the fire dies, he stumbles right onto it. Their temporary light gave them awareness, but their betrayal caused them to lose it — and now they are worse off than before, because they once knew the truth and rejected it.\n\nThis aligns with another verse: “That is because they believed, then they disbelieved; so their hearts were sealed” (Al-Munafiqun: 3). Their tragedy is not ignorance — it is enlightenment followed by betrayal.\n\nThe fire in the parable is not the fire of faith — it is the fire of pretence. It gives the illusion of light, but it is not connected to a lasting source. True faith is like a lamp fed by oil — it burns steadily. Hypocrisy is like dry grass — it flares brightly for a moment, then turns to ash.",
  "Reflections": "This parable is a warning about the danger of borrowed faith. How many today wear the clothes of Islam, speak its language, and perform its rituals — but their hearts are empty? They benefit from the Muslim community — its networks, its protection, its identity — but they do not submit to its truth. For a while, they seem enlightened: they give lectures, lead prayers, write articles. But when tested — when truth demands sacrifice — their light goes out.\n\nAnd when it does, they are left in deeper darkness than before, because now they know what they’ve lost, yet cannot return. They become cynical, bitter, mocking the very faith they once mimicked. They are deaf to reminders, dumb in the face of truth, blind to their own ruin.\n\nThe phrase “they will not return” is not a divine decree of eternal damnation, but a description of spiritual inertia. A man in total darkness does not know which way is out. He may want to return, but he has no map, no guide, no light. This is why the Prophet (peace be upon him) said: “The example of the believer is like a fresh green plant — it bends with the wind but does not break. The example of the hypocrite is like a dry reed — it stands straight until the first storm, then it snaps.”",
  "Similar Verses": ["57-12", "24-39", "6-122"]
}
