{
  "Surah": "Al-Baqarah",
  "Verse": "2:18",
  "Arabic Text": "صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ",
  "Transliteration": "Summun bukmun 'umyun fahum la yarji'oon",
  "English Translation": "Deaf, dumb, blind. They will not return.",
  "Linguistic Analysis": "Then comes the crushing diagnosis: “Summun bukmun ‘umyun” — “Deaf, dumb, blind.” These are not physical conditions, and there is no and (wa) in between them so the hypocrites are suffering from all three at same time but they are spiritual states: \nDeaf: they cannot hear truth, even when it is shouted. Their hearts are sealed to guidance. \nDumb: they cannot speak truth, because their tongues are tied to lies. Even if they wanted to, they lack the inner clarity to articulate faith. \nBlind: they cannot see the signs of Allah in the world, in revelation, or in their own souls.\n\nAnd the verse ends with “fahum la yarji‘oon” — “so they will not return.” The word “yarji‘oon” means to turn back, to repent, to come back to the right path. This is not a prediction of fate, but a description of their condition: so deep is their darkness, so complete their sensory loss, that return seems impossible. They are like a man lost in a cave with no torch, no sound, no voice — how can he find his way out?\n\nGrammatically, the parable moves from action (kindling) to consequence (darkness) to state (deaf, dumb, blind) to finality (no return). It is a complete spiritual autopsy.",
  "Context of Revelation": "This parable was revealed in Medina about the hypocrites, particularly those who embraced Islam outwardly but never internalised its truth. Ibn Abbas explained that they took pride in Islam — they married Muslims, inherited from them, shared in war spoils — but when they died, Allah stripped them of that honour, just as the fire’s light was taken away.\n\nIbn Mas‘ud gave a deeper interpretation: these were people who were once in the darkness of disbelief, then came to Islam and learned what is halal and haram, good and evil. But then they turned back to hypocrisy, and in doing so, lost even the knowledge they once had. Like a man who sees a snake in the firelight and steps back — but when the fire dies, he stumbles right onto it. Their temporary light gave them awareness, but their betrayal caused them to lose it — and now they are worse off than before, because they once knew the truth and rejected it.\n\nThis aligns with another verse: “That is because they believed, then they disbelieved; so their hearts were sealed” (Al-Munafiqun: 3). Their tragedy is not ignorance — it is enlightenment followed by betrayal.\n\nThe fire in the parable is not the fire of faith — it is the fire of pretence. It gives the illusion of light, but it is not connected to a lasting source. True faith is like a lamp fed by oil — it burns steadily. Hypocrisy is like dry grass — it flares brightly for a moment, then turns to ash.",
  "Reflections": "This parable is a warning about the danger of borrowed faith. How many today wear the clothes of Islam, speak its language, and perform its rituals but their hearts are empty?\n They benefit from the Muslim community its networks, its protection, its identity — but they do not submit to its truth. They were at guidance but now as they moved away they can't return back. For a while, they seem enlightened: they give lectures, lead prayers. But when tested — when truth demands sacrifice their light goes out.\n\nAnd when it does, they are left in deeper darkness than before, because now they know what they’ve lost, yet cannot return. They become cynical, bitter, mocking the very faith they once mimicked. They are deaf to reminders, dumb in the face of truth, blind to their own ruin.\n\nThe phrase “they will not return” is not a divine decree of eternal damnation, but a description of spiritual inertia. A man in total darkness does not know which way is out. He may want to return, but he has no map, no guide, no light. This is why the Prophet (peace be upon him) said: “The example of the believer is like a fresh green plant — it bends with the wind but does not break. The example of the hypocrite is like a dry reed — it stands straight until the first storm, then it snaps.”\n\nEvery time you read this parable, ask yourself: \nIs my faith a steady lamp — or a fleeting flame? \nDo I seek light for guidance — or just for show? \nIf my “fire” went out tonight, would I still know the way?\n\nBecause the greatest tragedy is not to be in darkness — it is to have held the light, and let it go.",
  "Similar Verses": ["7-179", "17-72", "6-39", "41-5", "63-3"]
}
