{
  "Surah": "Al-Baqarah",
  "Verse": "2:19",
  "Arabic Text": "أَوْ كَصَيِّبٍ مِّنَ السَّمَاءِ فِيهِ ظُلُمَاتٌ وَرَعْدٌ وَبَرْقٌ يَجْعَلُونَ أَصَابِعَهُمْ فِي آذَانِهِم مِّنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِ ۚ وَاللَّهُ مُحِيطٌ بِالْكَافِرِينَ",
  "Transliteration": "Aw kasayyibin mina as-sama'i fihi dhulumatun wa ra'dun wa barqun yaj'aluna asabi'ahum fi adhanihim mina as-sawa'iqi hadhar al-mawt. Wallahu muhitun bil-kafirin",
  "English Translation": "Or like a cloudburst from the sky, in which is darkness, and thunder, and lightning. They press their fingers into their ears from the thunderbolts, in fear of death. But Allah surrounds the disbelievers.",
  "Linguistic Analysis": "These verses present a second parable for the hypocrites, introduced by “aw” — “or” — which in Arabic here does not mean doubt, but offers an alternative image to deepen understanding. If the first parable (the fire) showed the loss of borrowed light, this one shows life in constant terror and instability.\n\nThe word “sayyib” means heavy rain, a downpour that comes suddenly from the sky. But this is no ordinary storm. It contains “dhulumat” — layers of darkness (from clouds, night, and confusion), “ra‘d” — thunder, and “barq” — lightning. In the understanding of the Companions and early scholars, based on the hadith of Ibn Abbas, thunder is the voice of an angel driving the clouds with whips of fire, and lightning is the flash of that whip, while thunderbolts (sawa‘iq) are fiery bolts that strike the earth. This is not myth — it is the Quranic worldview: even natural phenomena are acts of divine will, governed by angels.\n\nThe hypocrites in this storm “yaj‘aluna asabi‘ahum fi adhanihim min as-sawa‘iq” — “they press their fingers into their ears from the thunderbolts, in fear of death.” This is a physical reaction to terror — but spiritually, it symbolises their refusal to hear truth. When revelation comes — like thunder — they block it out, fearing exposure, punishment, or the demand to change. Their faith is not rooted; it is shaken by every trial, and their first instinct is self-preservation, not trust in Allah.\n\nThen comes the divine statement: “Wallahu muhitun bil-kafirin” — “But God surrounds the disbelievers.” The word “muhit” means to encircle completely from all sides — above, below, front, back. No escape is possible. Their attempt to hide, to block their ears, to flee — all is futile, because Allah’s knowledge and power encompass them entirely.\n\nInterestingly Allah compares hypocrites with disbelievers at this point, because He wants to show that they both are same.",
  "Context of Revelation": "Ibn Abbas and Ibn Mas‘ud explained that this parable was inspired by two hypocrites from Medina who fled to the Quraysh during a time of tension. A violent storm struck them — thunder so loud they feared death, lightning so bright it dazzled them. In that moment, they realised their vulnerability and said, “We wish we had stayed with Muhammad — we would embrace Islam properly.” They returned, repented, and their faith became sincere.\n\nBut Allah used their experience as a mirror for the hypocrites still in Medina. When the Prophet spoke in gatherings, they would literally put their fingers in their ears, fearing a verse would be revealed exposing them. When Islam prospered — after Badr, for example — they walked proudly among the Muslims. But when Uhud brought loss, they whispered, “This is because of Muhammad’s religion,” and some even left the battlefield.\n\nThus, the storm is a metaphor for the trials of life and revelation. The hypocrite is not tested by ease — he thrives in it. He is tested by difficulty — and in it, he collapses.",
  "Reflections": "This parable is terrifyingly relevant, so another sign of hypocrite is he tries to get away from a Islamic commandment or trial by ignoring it. How many today are like this?\n- They support Islam when it is popular, but stay silent when it is attacked.\n- They pray when healthy, but abandon Salah when stressed.\n- They give charity for show, but withhold when no one sees.\n- They claim faith in prosperity, but blame religion in hardship.\n\nTheir faith is weather-dependent. It has no roots. It is not a covenant with Allah — it is a transaction with circumstance.\n\nThe act of pressing fingers into ears is symbolic of modern avoidance: ignoring Quranic reminders, skipping sermons that challenge, muting voices of truth on social media. We fear not thunderbolts, but exposure, accountability, and the cost of true submission.\n\nAnd “whenever it illuminates, they walk” — this is the believer in name only. He follows Islam when it brings success, but abandons it when it demands sacrifice. He is not walking toward Allah — he is walking toward his own comfort, using faith as a tool.\n\nBut the final words — “God is capable of everything” — are both warning and hope. Warning: do not take your senses, your life, your faith for granted. Hope: if you are still able to hear and see, it is not too late to return.",
  "Similar Verses": ["13-13"]
}