{
  "Surah": "Al-Baqarah",
  "Verse": "2:20",
  "Arabic Text": "يَكَادُ الْبَرْقُ يَخْطَفُ أَبْصَارَهُمْ ۖ كُلَّمَا أَضَاءَ لَهُم مَّشَوْا فِيهِ وَإِذَا أَظْلَمَ عَلَيْهِمْ قَامُوا ۗ وَلَوْ شَاءَ اللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَارِهِمْ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
  "Transliteration": "Yakadu al-barqu yakhṭafu absarahum; kullama ada'a lahum mashaw fihi wa idha aẓlama 'alayhim qamū. Law shā'a Allāhu la dhahaba bi-sam'ihim wa abṣārihim. Inna Allāha 'alā kulli shay'in qadīr",
  "English Translation": "The lightning almost snatches their sight away. Whenever it illuminates for them, they walk in it; but when it grows dark over them, they stand still. Had God willed, He could have taken away their hearing and their sight. God is capable of everything.",
  "Linguistic Analysis": "The next image is even more vivid: “Yakadu al-barqu yakhṭafu absarahum” — “The lightning almost snatches their sight away.” “Yakadu” means “it nearly does”, showing intensity. The lightning is so bright it overwhelms the eyes — just as truth, when it flashes, exposes their hypocrisy so clearly they cannot bear to look. Yet they are dependent on it: “Whenever it illuminates for them, they walk in it” — when things are going well, when Islam brings them victory, wealth, or status, they move forward confidently, claiming faith. But “when it grows dark over them, they stand still” — when trials come, when the community faces hardship, they freeze, withdraw, or even apostatise. Their faith is conditional on comfort.\n\nThe verse ends with a sobering reminder: “Had God willed, He could have taken away their hearing and their sight. God is capable of everything.” This is not a threat of immediate punishment, but a declaration of absolute divine power. Allah allows them to hear and see — not because they deserve it, but because He gives respite. But if He willed, He could strip them of even the senses they misuse. Their temporary ability to function is by His mercy, not their right.\n\nGrammatically, the parable moves from chaos (storm) to reaction (fear) to divine reality (envelopment) to dependency (walking only in light) to ultimate power (Allah’s will). It is a portrait of spiritual fragility.",
  "Context of Revelation": "Ibn Abbas and Ibn Mas‘ud explained that this parable was inspired by two hypocrites from Medina who fled to the Quraysh during a time of tension. A violent storm struck them — thunder so loud they feared death, lightning so bright it dazzled them. In that moment, they realised their vulnerability and said, “We wish we had stayed with Muhammad — we would embrace Islam properly.” They returned, repented, and their faith became sincere.\n\nBut Allah used their experience as a mirror for the hypocrites still in Medina. When the Prophet spoke in gatherings, they would literally put their fingers in their ears, fearing a verse would be revealed exposing them. When Islam prospered — after Badr, for example — they walked proudly among the Muslims. But when Uhud brought loss, they whispered, “This is because of Muhammad’s religion,” and some even left the battlefield.\n\nThus, the storm is a metaphor for the trials of life and revelation. The hypocrite is not tested by ease — he thrives in it. He is tested by difficulty — and in it, he collapses.",
  "Reflections": "This parable is again mentioning blindness. They follow Islam when it is easy, this category of hypocrites had some Iman unlike previous one, they are still not blind and deaf.",
  "Similar Verses": ["13:19", "24:48"]
}
