{
  "Surah": "Al-Baqarah",
  "Verse": "2:3",
  "Arabic Text": "الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ",
  "Transliteration": "Alladhina yu'minuna bil-ghayb wa yuqimuna as-salata wa mimma razaqnahum yunfiqun",
  "English Translation": "Those who believe in the unseen, and perform the prayers, and give from what We have provided for them.",
  "Linguistic Analysis": "This verse begins describing the muttaqin — the God-fearing — whose guidance was promised in the previous verse. It lists three defining traits, and these are not random; they form a complete architecture: belief, worship, and charity — which are the inner dimensions of faith.\n\nFirst: “those who believe in the unseen” — “yuminuna bil-ghayb”. The word “iman” here is not mere intellectual assent. In Shariah, iman is conviction in the heart, affirmation by the tongue, and action by the limbs. The early scholars — Al-Shafi‘i, Ahmad ibn Hanbal, Abu Ubayd — all held that faith includes deed, and that it increases with obedience and decreases with sin. So belief here is living faith, not passive belief.\n\nNow, what is “al-ghayb”? Linguistically, it means anything hidden from the senses. But in this context, as explained by Ibn Abbas and confirmed by the famous Hadith of Jibril, it refers specifically to the core articles of faith: belief in Allah, His angels, His revealed Books, His messengers, the Last Day, and divine decree — both its good and its evil. It also includes everything the Prophet informed us about that lies beyond human perception: the torment of the grave, the resurrection, the scales, the bridge over Hell, Paradise, Hellfire, and the signs of the Hour.\nIbn Atiyyah rightly said these interpretations do not contradict each other — “al-ghayb” encompasses all of them, because all are unseen realities that the believer accepts solely on the authority of revelation.\n\nThe phrase “yuminuna bil-ghayb” is profound because it highlights a unique virtue of this Ummah. The Prophet (peace be upon him) said: “Good tidings for those who saw me and believed, and good tidings — seven times over — for those who believed in me without seeing me.” Ibn Mas‘ud once declared: “No one has believed better than the one who believes in the unseen.” Why? Because the earlier nations saw miracles with their eyes — Musa’s staff, ‘Isa healing the blind — but this Ummah believes without seeing, based only on the Quran and the truthful report of the Prophet. That is a higher rank of faith.\n\nSecond: “and perform the prayers” — “wa yuqimuna as-salah”. The verb “yuqimuna” comes from “iqamah”, which means to establish, to make firm, to maintain with continuity and care. It is not just “they pray”, but they uphold the prayer in its fullness: on time, with wudu, with khushu‘ (humility), with all its pillars and sunnahs. The word “salah” itself originally meant “supplication”, but in Shariah it refers to the ritual prayer with its fixed times, movements, and recitations. Some linguists trace it to “sala” — a vein near the hip — because in prayer, the worshipper bends and prostrates, lowering himself completely before Allah. Others say it comes from the image of a horse following closely behind another in a race (“musalli”), symbolising how prayer follows faith as its immediate expression.\n\nImportantly, “iqamah” implies consistency and steadfastness. It is not occasional prayer, but prayer that is rooted in daily life, like a tree firmly planted. The Companions understood this: Qatadah said establishing prayer means observing its time, its purity, its bowing, and its prostration — nothing neglected.\n\nThird: “and give from what We have provided for them” — “wa mimma razaqnahum yunfiqun”. Note the preposition “min” — “from”. It does not say “they give what We have provided”, but “from what We have provided”. This small word carries deep wisdom: Allah is the true Owner; humans are only trustees. Everything — wealth, health, time — is a rizq (provision) from Him. And the believer gives not all, but some, recognising that generosity must be balanced with responsibility — avoiding both stinginess and extravagance.\n\nThe word “yunfiqun” means to spend freely, to expend for a purpose. It includes both obligatory charity (zakat) and voluntary giving (sadaqah). Ibn Mas‘ud said it includes a man spending on his family. Al-Dahhak said it originally referred to all acts of worship by which one drew near to Allah, until specific rulings like zakat were revealed later. Ibn Jarir preferred the general meaning: any righteous spending for the sake of Allah, whether on relatives, the poor, or the cause of Islam.\n\nGrammatically, these three actions are in the present tense, indicating continuity — not one-time acts, but a lifestyle. And they are linked by “wa” (and), showing they are inseparable: true belief manifests in worship, and worship produces generosity.",
  "Context of Revelation": "This verse was revealed in Medina, where the Muslim community was transitioning from persecution to responsibility. New Muslims were learning not just to believe, but to live Islam in society. Many came from tribal backgrounds where prayer was unknown and charity was limited to kinship ties. So Allah defines the true believer not by lineage or declaration alone, but by three pillars:\n\n1. Inner conviction in unseen truths — distinguishing Islam from materialism.\n\n\n2. Regular connection with Allah through prayer — distinguishing it from mere ethics.\n\n\n3. Social responsibility through spending — distinguishing it from selfish spirituality.\n\n\nThe verse also responds to the Jews of Medina, who had scripture but often withheld charity and neglected prayer. Allah says: true faith is not inherited; it is lived. And it consoles the early Muslims: though you cannot see angels or Paradise, your belief in them is real — and rewarded.\n\nThere are beautiful narrations showing how the Prophet applied this. Once, people prayed facing Jerusalem, then were commanded to face the Ka‘bah. Those who immediately turned — even mid-prayer — were called by the Prophet: “Those are people who believed in the unseen.” Why? Because they obeyed a command they could not see the wisdom of — trusting Allah over their senses.\n\nAnother time, the Prophet said the best believers are those who will come after him, “believing in me without seeing me, and acting on the Book between two covers.” He then recited this very verse. So this verse is a direct address to us — the later generations — affirming that our faith, though unseen, is valid and valued.",
  "Reflections": "These three traits form the essence of a balanced Muslim life.\n\nBelief in the unseen if it is strong a Muslim keeps the heart connected to Allah through Salah mentioned next in series, so worldly life doesn’t become an end in itself.\n\nEstablishing prayer anchors the day in remembrance of Allah, preventing arrogance in success and despair in failure.\n\nSpending from provision breaks the love of wealth, turning money into a means of mercy, not a god.\n\n\nNotice the order: belief comes first, because action without belief is ritual; belief without action is hypocrisy. Prayer comes before charity, because you cannot give to creation with sincerity until you’ve connected with the Creator.\n\nAlso, the verse says “from what We have provided” — not “from what they earned”. This is a constant reminder: your wealth is not yours; it is a trust. The moment you forget that, charity becomes charity for show, not for Allah.\n\nAnd “the unseen” is not just about the afterlife — it includes Allah’s wisdom in trials, also the gain in charity even when eyes sees an apparent loss in wealth.",
  "Similar Verses": ["31-2"; "41-44"]
}