{
  "Surah": "Al-Baqarah",
  "Verse": "2:4",
  "Arabic Text": "وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ",
  "Transliteration": "Wa alladhina yu'minuna bima unzila ilayka wa ma unzila min qablika wa bil-akhirati hum yuqinun",
  "English Translation": "And those who believe in what was revealed to you, and in what was revealed before you, and are certain of the Hereafter.",
  "Linguistic Analysis": "These verses continue the description of the muttaqin — the God-fearing — begun in verse 2:3. Now, three more qualities are added, completing a comprehensive portrait of true faith. The first is belief in what was revealed to you — meaning the Quran given to Prophet Muhammad (peace be upon him). The second is belief in what was revealed before you — referring to the Torah, the Gospel, the Psalms, and other scriptures sent to earlier prophets. The third is certainty about the Hereafter — not just belief, but yaqeen, a deep, unshakable conviction.\n\nThe word “yuminuna” (they believe) is repeated from the previous verse, showing continuity. But here, belief is not just in the unseen in general, but in specific divine revelations. This is crucial: Islam does not reject previous scriptures; it affirms them in their original, unaltered form. The believer accepts that Allah has been guiding humanity through a chain of prophets, and Muhammad (peace be upon him) is the seal of that chain. To believe in him while rejecting Musa or ‘Isa — or to believe in them while rejecting him — is incomplete faith. True faith says: “We make no distinction between any of His messengers” (Al-Baqarah: 285).\n\nThe phrase “what was revealed to you” uses the past tense, even though the Quran was still being revealed when this verse was recited. This is a rhetorical device in Arabic to express certainty of occurrence — as if the entire Quran had already been sent down, because its revelation was guaranteed by Allah. It also shows that every part of the Quran, as it came, was to be accepted immediately, not selectively.\n\nThen comes “and in what was revealed before you”. The preposition “min qablika” (before you) refers to time, not rank. It does not mean earlier scriptures are inferior, but that they came earlier in the sequence of divine communication. The believer honours them as true revelations in their original form, while recognising that the Quran is the final, preserved, and universal guidance that confirms and corrects what was distorted over time.\n\nNow, the third quality: “and of the Hereafter they are certain” — “wa bil-akhirati hum yuqinun”. The word “akhirah” literally means “the latter” — the life that comes after this temporary one. It is contrasted with “dunya” (the present world). But “yuqinun” is stronger than “yuminun”. Iman is belief; yaqeen is certainty beyond doubt, like the certainty of seeing something with your own eyes. This level of conviction transforms behaviour: if you are truly certain of the Hereafter, you will not lie for profit, you will not oppress for power, and you will not delay repentance — because you see the Hereafter as more real than this world.",
  "Context of Revelation": "These verses were revealed in Medina, where Muslims lived alongside Jews and Christians. Many Jews claimed to believe in their scripture but rejected the Quran, saying, “We only follow what came to us.” Some Christians accepted ‘Isa as divine but denied the finality of Muhammad’s prophethood. In this environment, Allah defines the true believer as one who accepts all divine revelation without discrimination.\n\nSome early interpreters, like Ibn Abbas and Ibn Mas‘ud, said these verses specifically refer to righteous People of the Book who embraced Islam — those who believed in their own prophets and also accepted Muhammad (peace be upon him) as the final messenger. The Quran itself confirms this: “Among the People of the Scripture are those who believe in Allah and what was revealed to you… They will be given their reward twice” (Al-Qasas: 52–54). But the majority view, supported by Ibn Jarir and the broader context, is that these verses describe all true believers, including the Arab Muslims, because the command to believe in all scriptures was given to the entire Ummah: “O you who believe, believe in Allah and His Messenger and the Book He revealed to His Messenger and the Scripture He revealed before” (An-Nisa’: 136).\n\nSo while some early Muslims were from the People of the Book, the description applies universally: anyone who believes in the Quran, honours the previous revelations in their true form, and is certain of the Hereafter belongs to this group.\n\nThe Prophet (peace be upon him) embodied this. He honoured the Torah, stood up for a Jewish funeral, and said, “If Musa were alive today, he would have no choice but to follow me.” He did not reject previous prophets; he completed their message.",
  "Reflections": "These verses teach us that true faith is inclusive in its recognition of divine truth, yet exclusive in its source. It recognises that Allah spoke to many nations, but affirms that the Quran is the final, preserved word. It does not say, “All religions are the same,” but it also does not say, “Only our prophet matters.” It says: “We believe in all of them — without distinction.”\n\nThis is a cure for two diseases:\n\n1. Religious arrogance — thinking that because we have the final revelation, we can dismiss earlier prophets.\n\n\n2. Religious relativism — thinking that all scriptures are equally valid today, ignoring that the Quran abrogates and corrects what was altered.\n\n\nAlso, the emphasis on yaqeen in the Hereafter is a direct antidote to worldly distraction. In a time when people live as if they will never die, the believer is marked by eternal consciousness. He gives charity not for praise, but because he sees the scales. He prays at night not for show, but because he fears the questioning. His certainty is not theoretical — it is practical, daily, and transformative.\n\nOne important conclusion from this ayat is we are commanded to believe on scriptures revealed till Qur'an, but after this revelation there is no other revelation for believers - this rejects the claim of Qadiyani sect that Mirza Ghulam recieved any revelation and his knowledge is of no use to Ummah now.",
  "Similar Verses": ["2-136; "2-285"; "3-84"; "4-152"; "31-5"]
}