{
  "Surah": "Al-Baqarah",
  "Verse": "2:7",
  "Arabic Text": "خَتَمَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰ أَبْصَارِهِمْ غِشَاوَةٌ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ",
  "Transliteration": "Khatama Allahu ‘ala qulubihim wa ‘ala sam’ihim, wa ‘ala absarihim ghashawah, wa lahum ‘adhabun ‘adheem",
  "English Translation": "God has set a seal on their hearts and on their hearing, and over their vision is a veil. They will have a severe torment.",
  "Linguistic Analysis": "Then comes the most severe part: “Khatama Allahu ‘ala qulubihim wa ‘ala sam’ihim, wa ‘ala absarihim ghashawah.”\n\n“Khatama” means to seal, like sealing a letter so no one can open it.\n\n“Ghashawah” means a covering or veil, like a thick cloth over the eyes.\n\n\nThese are not literal seals on physical organs, but metaphors for spiritual incapacity. Their hearts cannot comprehend truth, their ears cannot internalise guidance, and their eyes cannot see the signs of Allah in creation. They hear words, but no meaning enters. They see miracles, but no awe arises. This is the ultimate punishment: to be surrounded by truth and remain blind to it.\n\nGrammatically, the sealing is attributed directly to Allah — “Khatama Allahu” — which raises a deep theological point. Does Allah force them to disbelieve? No. The scholars explain that this sealing is a consequence of their own choices. As the Prophet (peace be upon him) said: “When a believer sins, a black spot appears on his heart. If he repents, it is polished clean. But if he continues, the spots increase until his heart is sealed.” So Allah seals the heart only after the servant has repeatedly chosen disbelief. It is not the cause of their unbelief, but the divine confirmation of a state they have chosen.\n\nThe verse ends with “wa lahum ‘adhabun ‘adheem” — “and for them is a severe torment.” The word “‘adhab” comes from a root meaning confinement or restriction — punishment is not just pain, but the loss of freedom, light, and hope. And “‘adheem” (great, severe) shows it is not temporary or light, but eternal and overwhelming.",
  "Context of Revelation": "One important thing to notice is here Allah seals their heart first as they refused to be guided and hold on to Taqwa, while in Surah Al-Jathiya ayat 23 Allah seals hearing first as there they refused to listen to Qur'an and turns away in arrogance in Surah Al-Jathiya ayat 8.",
  "Reflections": "Allah sealed their hearts which is same place from where Taqwa and doubt arise. Finally, the “severe torment” is not mentioned to frighten, but to awaken. It reminds us that disbelief is not a private choice — it is a rebellion against the Creator of the heavens and earth, and such rebellion cannot go unanswered in a universe governed by justice.",
  "Similar Verses": ["16-108"; "36-9"; "45-23"]
}