{
  "Surah": "Al-Baqarah",
  "Verse": "2:9",
  "Arabic Text": "يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلَّا أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
  "Transliteration": "Yukhadi‘una Allaha wa alladhina amanu, wa ma yakhda‘una illa anfusahum wa ma yash‘urun",
  "English Translation": "They seek to deceive God and those who believe, but they deceive none but themselves, though they are not aware.",
  "Linguistic Analysis": "Then comes the shocking phrase: “They seek to deceive Allah and those who believe.” The verb “yukhadi‘una” comes from “khud‘a”, which means to deceive through cunning, to play a double game. But how can anyone deceive Allah? He knows the unseen, the secrets of hearts, the whispers of souls. The scholars explain: they do not truly deceive Allah — they act as if they can. They perform rituals outwardly while harbouring disbelief inwardly, thinking that Allah will accept the form without the substance. This is the essence of hypocrisy: worship as performance, not submission.\n\nThe grammatical form “yukhadi‘una” is in the intensive verb pattern, implying repeated, deliberate effort — not a slip, but a strategy. And the object is twofold: Allah and the believers. They try to fool the community into accepting them as Muslims, and in their delusion, they imagine they can even fool the Creator.\n\nBut then comes the divine rebuttal: “but they deceive none but themselves.” This is the tragic irony of hypocrisy. Deception only works when the other party is ignorant. But Allah is not ignorant — so their act changes nothing in His knowledge. All it does is trap them in their own lie. They lose the chance to repent, because they keep telling themselves, “I’m fine — I pray, I fast, I say the Shahadah.” Meanwhile, their hearts rot in secret disbelief.\n\nThe final phrase — “though they are not aware” — “wa ma yash‘urun” — is chilling. “Shu‘ur” means conscious awareness, sensory perception. They are so deep in self-deception that they do not feel the spiritual decay. Like a man with gangrene who feels no pain, they are dying inside without knowing it.\n\nSome reciters read “yakhda‘una” (they deceive) in the second instance instead of “yukhadi‘una”, but the meaning remains: their deception is real in intent, futile in outcome.",
  "Context of Revelation": "Same as previous ayat.",
  "Reflections": "Allah here explains that there are two types of hypocrites 1) those who know that they are hypocrites, they just pretend to be muslims and 2) those who are unware that they lack Iman and this category is more dangerous.\nThe sahaba use to fear from the second type so much that, they use to ask each other do you think I am hypocrite?\n Yet we are unaware of our state of Iman and have belief that we will be granted paradise.",
  "Similar Verses": ["4-142"]
}